<h2>Hallintovalikko</h2>
<ul>
<li><b>Kaudet:</b> Kauden hallinta ja uusien kausien/turnauksien luominen</li>
<li><b>Sarjaformaatit:</b> Sarjaformaatit, joita k&auml;ytet&auml;&auml;n lohkojen luomisen pohjana</li>
<li><b>Seurat &amp; Maat:</b> Seura- ja maalistaus, k&auml;ytet&auml;&auml;n joukkueilmoittautumisen yhteydess&auml;</li>
<li><b>Pelipaikat:</b> Fyysiset pelipaikat, joista tehd&auml;&auml;n kentt&auml;varauksia</li>
<li><b>Varaukset:</b> Kentt&auml;varaukset, kaikille kausille/turnauksille yhteiset</li>
<li><b>K&auml;ytt&auml;j&auml;t:</b> K&auml;ytt&auml;jien hallinta</li>
<li><b>Tapahtumaloki:</b> Tapahtumien seuranta</li>
<li><b>Tietokanta:</b> Tietokannan yll&auml;pito ja seuranta</li>
<li><b>Ohjeet:</b> Ohjedokumentaatio</li>
<li><b>Omat asetukset:</b> K&auml;ytt&auml;j&auml;n omiin asetuksiin p&auml;&auml;see klikkaamalla oikeassa yl&auml;kulmassa n&auml;kyv&auml;&auml; k&auml;ytt&auml;j&auml;n nime&auml;</li>
</ul>


<h2>Kauden luominen</h2>
<ol>
<li>Kauden luominen: valitse <a href='?view=admin/seasons'>&raquo; Kaudet</a></li>
<li>Lis&auml;&auml; uusi kausi
	<ul>
		<li><b>Kausitunnus:</b> vapaavalintainen tunnus (esim. 2010.1 tai NSUTXXV)</li>
		<li><b>Nimi:</b> kauden pelikoneessa n&auml;kyv&auml; nimi (esim. Kes&auml; 2010)</li>
		<li><b>Tyyppi:</b> pelialustan ja formaatin mukaan</li>
		<li><b>Turnaus:</b> jos tapahtuma on yksitt&auml;inen turnaus</li>
		<li><b>Kansainv&auml;linen:</b> jos tapahtuma on kansainv&auml;linen. Kansainv&auml;lisiss&auml; tapahtumissa n&auml;ytet&auml;&auml;n joukkueen kotimaa.</li>
		<li><b>Maajoukkueille:</b> jos tapahtumaan osallistutaan maajoukkuien. Jos raksia ei ole, tapahtuma on seurajoukkueille.</li>
		<li><b>Spirit malli:</b> K&auml;ytett&auml;v&auml; pohja spirit pisteiden antamiseen.</li>
		<li><b>Spirit-pisteet n&auml;kyviss&auml;:</b> Jos spirit-pisteet n&auml;kyv&auml;t kaikille k&auml;ytt&auml;jille.</li>
		<li><b>Pisteet:</b> Kauden aikana joukkueille annetaan pisteit&auml; esimerkiksi osaturnauksista.</li>
		<li><b>J&auml;rjest&auml;j&auml;:</b> Tapahtuman j&auml;rjest&auml;j&auml;, esimerkiksi SLKL tai WFDF.</li>
		<li><b>Kategoria:</b> Tapahtuman luokittelu, esimerkiksi WUGC, WUCC </li>
		<li><b>Alkaa:</b> vapaavalintainen p&auml;iv&auml;m&auml;&auml;r&auml; (esim. kauden ensimm&auml;inen turnaus)</li>
		<li><b>Loppuu:</b> vapaavalintainen p&auml;iv&auml;m&auml;&auml;r&auml; (esim. kauden viimeinen turnaus)</li>
		<li><b>Avoin ilmoittautumiselle:</b> pelikoneeseen rekister&ouml;ityneet k&auml;ytt&auml;j&auml;t voivat ilmoittaa joukkueita kaudelle</li>
		<li><b>Ilmoittautuminen loppuu:</b> vapaavalintainen p&auml;iv&auml;m&auml;&auml;r&auml; (n&auml;kyy k&auml;ytt&auml;jille, mutta ei rajoita ilmoittautumista)</li>
	</ul></li>
<li>Kauden lis&auml;&auml;misen j&auml;lkeen kausivalikon pit&auml;isi ilmesty&auml; vasempaan navigointi menuun. Kausivalikko:
	<ul>
	<li><b>Sarjat:</b> Kauden sarjojen hallinta</li>
	<li><b>Lohkot:</b> Kauden lohkojen hallinta</li>
	<li><b>Joukkueet:</b> Kauden joukkueiden hallinta</li>
	<li><b>Pelit:</b> Kauden pelien hallinta</li>
	<li><b>Sarjataulukot:</b> Kauden sarjataulukkojen hallinta</li>
	<li><b>Akkreditointi:</b> Pelaajien akkreditointi</li>
	<li><b>Vastuupelit:</b> Kauden vastuupelit</li>
	<li><b>Yhteystiedot:</b> Joukkueiden yhteystiedot</li>
	</ul></li>
<li>Jos kausi on avoin ilmoittautumiselle lis&auml;ksi vasempaan navigointi menuun ilmestyy ilmoittautumiset -valikko</li>
</ol>

<h2>Sarjojen luominen</h2>
<ol>
<li>Valitse sarjat -kausivalikosta</li>
	<li>Lis&auml;&auml; uusi sarja
		<ul>
			<li><b>Nimi:</b> sarjan pelikoneessa n&auml;kyv&auml; nimi (esim. Avoin)</li>
			<li><b>J&auml;rjestys:</b> j&auml;rjestys valikossa</li>
			<li><b>Tyyppi:</b> sarjan tyyppi</li>
			<li><b>Voimassa:</b> sarja on aktiivinen ja n&auml;ytet&auml;&auml;n valikoissa</li>
		</ul></li>
	<li>Luo tarvittava m&auml;&auml;r&auml; sarjoja. Joukkueilmoittautuminen kaudelle on sarjakohtainen.</li>
</ol>

<h2>Joukkueiden luominen</h2>
<p>Normaalisti pelikoneeseen rekister&ouml;ityneet k&auml;ytt&auml;j&auml;t ilmoittautuvat joukkueet mukaan kaudelle.</p>
<ol>
<li>Kausi on avoin ilmoittautumiselle</li>
<li>Rekister&ouml;itynyt k&auml;ytt&auml;j&auml; kirjautuu pelikoneeseen ja ilmoittaa joukkueen mukaan sarjaan</li>
<li>Sarjavastaava hyv&auml;ksyy ilmoittautumisen ilmoittautumiset -valikosta</li>
<li>Joukkueen ilmoittaneesta k&auml;ytt&auml;j&auml;st&auml; tulee joukkuevastaava</li>
</ol>
<p>Joukkueiden manuaalinen lis&auml;&auml;minen.</p>
<ol>
<li>Lis&auml;&auml; joukkueet ilmoittautumiset -valikosta tai joukkueet -kausivalikosta</li>
<li>Joukkueen yhteyshenkil&ouml;n voit lis&auml;t&auml; joukkueet -kausivalikosta, joukkueen asetuksista tai k&auml;ytt&auml;j&auml;t -hallintovalikosta</li>
</ol>

<h2>Lohkojen luominen</h2>
<ol>
<li>Luo s&auml;&auml;nt&ouml;pohja sarjaformaatit -hallintovalikosta, jos ei ole olemassa sopivaa pohjaa:
<ul>
	<li><b>Nimi:</b> Pohjan nimi (esim. slkl avoin kes&auml;)</li>
	<li><b>Tyyppi:</b> Sarja = round robin lohko, pudotuspeli = lohkon ensimm&auml;inen vastaan lohkon viimeinen</li>
	<li><b>Joukkueita:</b> Joukkueiden lukum&auml;&auml;r&auml; lohkossa</li>
	<li><b>Pelit pisteeseen:</b> S&auml;&auml;nt&ouml;jen mukainen pisteraja</li>
	<li><b>Puoliaika:</b> Puoliajan kesto</li>
	<li><b>Puoliaika pisteess&auml;:</b> Puoliajan pisteraja</li>
	<li><b>Aikakatto:</b> S&auml;&auml;nt&ouml;jen mukainen aikaraja</li>
	<li><b>Aikavaraus:</b> Ottelulle varattu aika (ohjeistaa kentt&auml;varausta)</li>
	<li><b>Pistekatto:</b> S&auml;&auml;nt&ouml;jen mukainen maksimi pistem&auml;&auml;r&auml;</li>
	<li><b>Lis&auml;pisteet aikarajan t&auml;ytytty&auml;:</b> S&auml;&auml;nt&ouml;jen mukainen pistem&auml;&auml;r&auml; (esim. johtava +2)</li>
	<li><b>Pisteiden v&auml;linenaika:</b> S&auml;&auml;nt&ouml;jen mukainen aikaraja</li>
	<li><b>Aikalisi&auml;:</b> Monta aikalis&auml;&auml; per peli tai per puoliaika</li>
	<li><b>Aikalis&auml;n kesto:</b> S&auml;&auml;nt&ouml;jen mukainen aikaraja</li>
	<li><b>Aikalisi&auml; lis&auml;ajalla:</b> Aikalisien lukum&auml;&auml;r&auml; aikakaton t&auml;ytytty&auml;</li>
	<li><b>Jatkosarja:</b> Onko kyseess&auml; alkulohko vai jatkolohko</li>
	<li><b>Siirr&auml;:</b> Siirrett&auml;v&auml;t ottelut</li>	
	</ul></li>
	
<li>Valitse lohkot -kausivalikosta</li>
	<li>Lis&auml;&auml; uusi lohko
		<ul>
			<li><b>Nimi:</b> lohkon pelikoneessa n&auml;kyv&auml; nimi (esim. SM-alkusarja)</li>
			<li><b>J&auml;rjestys:</b> j&auml;rjestys valikossa ja sijoituslohkojen keskin&auml;inen j&auml;rjestys</li>
			<li><b>Pohja:</b> S&auml;&auml;nt&ouml;pohja</li>
			<li><b>N&auml;kyviss&auml;:</b> Lohko n&auml;ytet&auml;&auml;n valikoissa (esim. jatkolohkon voi piilottaa ennen kuin joukkueet on selvill&auml;)</li>
			<li><b>Pelattu:</b> Lohkon kaikki pelit on pelattu</li>
			<li><b>Jatkolohko:</b> Jos kyseess&auml; on jatkolohko</li>
			<li><b>Sijoituslohko:</b> Jos yhdenk&auml;&auml;n lohkossa pelaavan joukkueen sijoitus sarjassa m&auml;&auml;r&auml;ytyy lohkon sijoituksen perusteella</li>
			<li><b>V&auml;ri:</b> Lohkon tunnusv&auml;ri (esim. lohkon pelit n&auml;kyv&auml;t t&auml;ll&auml; v&auml;rill&auml; aikataulutuksessa)</li>
		</ul></li>
	<li>Lohkon asetukset
		<ul>
			<li><b>Nimi:</b> lohkon pelikoneessa n&auml;kyv&auml; nimi (esim. SM-alkusarja)</li>
			<li><b>J&auml;rjestys:</b> j&auml;rjestys valikossa ja sijoituslohkojen keskin&auml;inen j&auml;rjestys</li>
			<li><b>Joukkueita:</b> Joukkueiden lukum&auml;&auml;r&auml; lohkossa</li>
			
		</ul></li>
<li>Sijoituslohkot m&auml;&auml;r&auml;&auml;v&auml;t joukkueiden keksin&auml;isen j&auml;rjestyksen sarjassa. Esimerkiksi finaalilohkossa (j&auml;rjestys AA) ratkaistaan sijoitukset 1 ja 2.
Pronssilohkossa (j&auml;rjestys AB) ratkaistaan sijoitukset 3 ja 4. Sijoituslohkojen keskin&auml;inen j&auml;rjestys on t&auml;rke&auml;, sill&auml; jos pronssilohko olisi j&auml;rjestyksell&auml; 
AA ja finaali AB pelikone p&auml;&auml;ttelisi sijoitukset 1 ja 2 pelattavan pronssipeliss&auml;.
</li>
<li>Palaa takaisin Lohkot -kausivalikkoon ja valitaksesi joukkueet lohkoon</li>
</ol>

<h2>Joukkueiden hallinta</h2>
<p>Joukkueiden lis&auml;&auml;minen alkusarjoihin. Kaikki sarjan alkulohkot ja joukkueet tulee olla luotuna.</p>
<ol>
<li>Valitse Lohkot -kausivalikosta "valitse joukkueet" -toiminto</li>
<li>Avautuvassa n&auml;kym&auml;ss&auml; on listattu kaikki sarjan joukkueet ja alkulohkot</li>
<li>Joukkueita voi raahata hiirell&auml; lohkosta toiseen</li>
<li>Joukkueiden rankkaus on sama kuin joukkueiden j&auml;rjestys lohkossa</li>
<li>Lopuksi tallenna muutokset</li>
</ol>
<p>Joukkueiden lis&auml;&auml;minen jatkosarjoihin.</p>
<ol>
<li>Luo jatkosarja tyyppinen lohko</li>
<li>Valitse Lohkot -kausivalikosta "siirr&auml; joukkueet" -toiminto</li>
<li>Avautuvassa n&auml;kym&auml;ss&auml; on listattu kaikki joukkueiden siirrot ko. lohkoon</li>
<li>Valitse "lis&auml;&auml; siirtoja"</li>
<li>Lis&auml;&auml; siirtos&auml;&auml;nt&ouml;j&auml;: Joukkue lohkosta x siiret&auml;&auml;n t&auml;h&auml;n lohkoon sijalle n</li>
<li>Palaa edelliselle sivulle</li>
<li>Jos kaikki pelit on pelattu ja joukkuesiirrot sek&auml; siirrett&auml;v&auml;t pelit oikein voit vahvistaa siirrot
	<ul>
		<li>Jos joukkuiden j&auml;rjestys on laskettu v&auml;&auml;rin alkulohkossa, voit muuttaa j&auml;rjestyst&auml; k&auml;sin Sarjataulukot -kausivalikosta</li>
		<li>Siirrett&auml;v&auml;t ottelut m&auml;&auml;ritet&auml;&auml;n lohkon asetuksissa</li>
	</ul></li>
</ol>

<h2>Pelien luominen</h2>
<ol>
<li>Valitse Lohkot -kausivalikosta "pelienhallinta" -toiminto</li>
	<li>Kaikki joukkueet pit&auml;&auml; olla valittuna lohkoon</li>
	<li>Voit tarkistaa luotavat pelit "n&auml;yt&auml; pelit" -toiminnolla</li>
	<li>Luo pelit "Luo kaikki pelit" -toiminnolla</li>
	<li>Voit luoda my&ouml;s yksitt&auml;isi&auml; pelej&auml;, mutta yleens&auml; t&auml;h&auml;n ei ole tarvetta</li>
</ol>

<h2>Pelien aikatauluttaminen</h2>
<ol>
<li>Pelipaikat -toimintovalikosta voit lis&auml;t&auml; pelipaikkoja</li>
	<li>Valitse lis&auml;&auml;
		<ul>
		<li><b>Nimi: </b>Pelipaikan nimi</li>
		<li><b>Osoite: </b>Pelipaikan osoite. Osoitteen antamisen j&auml;lkeen hae kordinaatit.</li>
		<li><b>Info: </b>Lis&auml;tietoa pelipaikasta</li>
		<li><b>Kentti&auml;: </b>Monta kentt&auml;&auml; on pelipaikassa</li>
		<li><b>Sis&auml;kentti&auml;: </b>Jos kent&auml;t ovat sis&auml;kentti&auml;</li>
		</ul></li>
<li>Varaukset -toimintovalikosta lis&auml;t&auml;&auml;n kentt&auml;varauksia pelipaikoille</li>	
	<li>Valitse lis&auml;&auml; varaus
		<ul>
		<li><b>Pvm: </b>Varauksen p&auml;iv&auml;m&auml;&auml;r&auml;</li>
		<li><b>Alkuaika: </b>Varauksen alkuaika</li>
		<li><b>Loppuaika: </b>Varauksen loppuaika</li>
		<li><b>Turnaus: </b>Turnauksen nimi, varaukset ryhmitell&auml;&auml;n annetun nimen mukaan</li>
		<li><b>Kentt&auml;: </b>Kent&auml;n numero</li>
		<li><b>Paikka: </b>Pelipaikka</li>
		</ul></li>
<li>Palaa varaus -valikkoon</li>
<li>Hae varauksia p&auml;iv&auml;m&auml;&auml;r&auml;n, turnauksen tai paikan perusteella</li>
<li>Valitse aikataulutettavat varaukset</li>
<li>Avautussa valikossa n&auml;kyy valitut kentt&auml;varaukset ja pelit ilman aikataulua
		<ul>
		<li>Raahaa pelit kentt&auml;varauksiin</li>
		<li>Ruksista voit piilottaa pelin, se ei poista itse peli&auml;</li>
		<li>Voit lis&auml;t&auml; halutun pituisia taukoja</li>
		<li>Paina lopuksi tallenna</li>
		</ul></li>
</ol>

<h2>Pelaajien akkreditointi</h2>
<p>Kun joukkue on lis&auml;nnyt pelaajan pelaajalistalle, pelaajan pelioikeus tulee tarkistaa.</p>
<ol>
<li>Akkreditointi -kausivalikosta voi tehd&auml; automaattisen akkreditoinnin sek&auml; kuitata pelaajat jotka ovat pelanneet ilman pelioikeutta (esim. pelioikeuden tarkistusta ei ole ehditty teken&auml;&auml;n ennen peli&auml;)</li>
<li>Joukkueet -kausivalikosta valitse joukkueen pelaajalista suorittaakesi joukkuekohtaisen manuaalisen pelaaja akkreditoinnin.</li>
</ol>