<p>Pelikone on Ultimaten tulospalvelu. Pelikonetta voi k&auml;ytt&auml;&auml; sek&auml; kauden ett&auml; yksitt&auml;isen turnauksen tulospalveluna.
Pelikoneen selaaminen ei vaadi rekister&ouml;itymist&auml;.</p>

<h2>Pelikoneen selaaminen</h2>

<ul>
<li><b>Aikataulut</b> - kauden peliaikataulut
	<ul>
		<li>Otteluhistoria - jos joukkueet ovat kohdanneet aikaisemmin, n&auml;kyy otteluhistoria linnki pelin kohdalla.</li>
		<li>Kalenteri - aikataulujen lopusta olevasta iCalendar-linkist&auml; voit vied&auml; peliaikataulut esim. Googlen kalenteriin.</li>
		<li>Tulostus - Aikataulut voit tulostaa joko pdf-muodossa tai sivun alalaidassa olevasta tulostus linkist&auml;.</li>
	</ul></li>
</ul><ul>
<li><b>Pelatut pelit</b> - kaikki kaudella pelatut pelit
	<ul>
		<li>Pelin kulku - kun ottelun p&ouml;yt&auml;kirja on sy&ouml;tetty pelikoneeseen, niin pelin kulku -linkki ilmestyy tuloksen viereen.</li>
		<li>Tulostus - ottelutulokset voi tulostaa pdf-muodossa.</li>
	</ul></li>
</ul><ul>	
<li><b>Joukkueet</b> - kaudella pelaavat joukkueet
	<ul>
		<li>Rankkaus - voit listata joukkueet sarjan, lohkon, rankkauksen ja lopullisen sijoituksen perusteella.</li>
		<li>Joukkuekortti - joukkueen nime&auml; klikkaamalla n&auml;et joukkuekortin.</li>
		<li>Seurakortti - seuran nimest&auml; avaat seurakortin.</li>
		<li>Pelaajakortti - pelaajan nime&auml; klikkaamalla n&auml;et pelaajakortin.</li>
		<li>Pelaajalista - pelaajalista linkist&auml; l&ouml;ytyy yhteenveto joukkueen pelaajien pelihistoriasta.</li>		
		<li>Pistep&ouml;rssi - pistep&ouml;rssi linkist&auml; l&ouml;ytyy joukkueen sis&auml;inen pistep&ouml;rssi.</li>
		<li>Pelit - pelit linkist&auml; l&ouml;ytyy joukkueen pelatut ja tulevat pelit.</li>
	</ul></li>
</ul><ul>	
<li><b>Pelisysteemi</b> - kauden sarjat ja lohkot
	<ul>
		<li>Kausi - kauden nime&auml; klikkaamalla n&auml;et kauden lopulliset sijoitukset.</li>
		<li>Sarja - sarjan nime&auml; klikkaamalla l&ouml;yd&auml;t sarjan tilastot ja pistep&ouml;rssin.</li>
		<li>Lohko - lohkon nimest&auml; n&auml;et lohkon sijoitukset ja pistep&ouml;rssin.</li>
	</ul></li>
</ul><ul>	
<li><b>Vanhat tapahtumat</b> - edellisten kausien tilastot
	<ul>
		<li>Kaudet - vanhat tapahtumat otsikkoa klikkaamalla n&auml;et kaikki kaudet.</li>
		<li>Pelaajat - kaikki pelaajakortit.</li>
		<li>Joukkueet - kaikki joukkuekortit.</li>
		<li>Seurat - kaikki seurakortit.</li>
		<li>Tilastot - yhteenveto voittaneista joukkueista ja kaikkienaikojen pistep&ouml;rssit.</li>
	</ul></li>	
</ul><ul>	
<li><b>Pelikone linkit</b> - pelikoneen linkitt&auml;minen muille sivuille
	<ul>
		<li>RSS - sy&ouml;tteet kauden otteluista.</li>
		<li>Twitter - pelitulokset (jos tulosten Twitter postaus p&auml;&auml;ll&auml;).</li>
		<li>Kehykset - esimerkkej&auml; kuinka liit&auml;t pelikoneen tilastoja omalle sivullesi.</li>
	</ul></li>	
</ul><ul>	
<li><b>Tiedon vienti</b> - pelikoneen datan vienti tiedostoon.
</ul><ul>	
<li><b>Mobiili yll&auml;pito</b> - yksinkertaistettu sivusto pelitulosten sy&ouml;tt&auml;miseen puhelimella.
</li>	
</ul>

<h2>Rekister&ouml;ityneet k&auml;ytt&auml;j&auml;t</h2>

<p>Tiedon sy&ouml;tt&auml;minen pelikoneeseen vaatii rekister&ouml;itymisen. Rekister&ouml;ityneill&auml; k&auml;ytt&auml;j&auml;lle mahdolliset toiminnallisuudet
riippuvat k&auml;yttj&auml;n oikeuksista. Rekister&ouml;ityminen onnistuu noudattamalla "uusi k&auml;ytt&auml;j&auml;?" -linkist&auml; avautuvia ohjeita.</p>

<p><b>Katsoja/Kuvaaja</b> kaikilla rekister&ouml;ityneill&auml; k&auml;ytt&auml;jill&auml; on oikeus linkitt&auml;&auml; kuvia tai videoita pelaaja-, joukkue- ja seurakorttiin 
sek&auml; pelin kulkuun. Median lis&auml;ys linkki n&auml;kyy aina sellaisen sivun alalaidassa, jolle mediaa voi lis&auml;t&auml;. Katsoja voi muokata 
omia tietoja ja valikkon&auml;kym&auml;&auml; klikkaamalla k&auml;ytt&auml;j&auml;tunnustaan sivun yl&auml;laidasta.</p> 

<p><b>Pelaaja</b> voi muokata omaa pelaajakorttia, jos joukkuevastaava on liitt&auml;nyt s&auml;hk&ouml;postiosoitteen pelaajakorttiin.
S&auml;hk&ouml;postiosoite tarvitaan, koska sen perusteella tunnistetaan mit&auml; pelaajakorttia k&auml;ytt&auml;j&auml; saa muuttaa. 
S&auml;hk&ouml;postin tulee olla sama mill&auml; k&auml;ytt&auml;j&auml; rekister&ouml;ityy pelikoneeseen. Omaan k&auml;ytt&auml;j&auml;tunnukseen voi liitt&auml;&auml; my&ouml;s lis&auml;&auml; s&auml;hk&ouml;postiosoitteita 
omien tietojen hallinnan kautta.</p>

<p><b>Joukkuevastaava</b> voi muokata joukkueen pelaajalistaa, joukkuekorttia, joukkueen seruakorttia ja joukkueenpelaajien pelaajakortteja.
Joukkuevastaavan oikeudet saat automaattisesti kun olet rekister&ouml;ityneen&auml; k&auml;ytt&auml;j&auml;n&auml; ilmoittautanut joukkueen mukaan kaudelle. 
Joukkueen ilmoittautuminen tapahtuu ilmoittautumisen ollessa avoinna kaikille rekister&ouml;ityneille k&auml;ytt&auml;jille n&auml;kyv&auml;st&auml; joukkueen
ilmoittaminen linkist&auml;. Ilmoittautumisajan j&auml;lkeen joukkuevastaavan oikeuksia voi pyyt&auml;&auml; sarjavastaavalta. 
Joukkuevastaavalla on oikeudet sy&ouml;tt&auml;&auml; oman joukkueen kotipelien tulokset ja p&ouml;yt&auml;kirjat pelikoneeseen.</p>

<p><b>Sarjavastaava</b> vastaa nimens&auml; mukaan sarjoista ja lohkoista sek&auml; pelien aikatauluttamisesta. Sarjavastaavat ovat
nimetty liitokiekkoliiton toimesta ja heille on annettu oikeudet hallita kauden sarjoja. Jos huomaat virheit&auml; pelisysteemiss&auml; tai
aikatauluissa, ota yhteytt&auml; sarjavastaaviin.</p>
